app/controllers/leads_controller.rb

SELECT "leads".* FROM "leads"
---
  def index
    @leads = Lead.all

INSERT INTO "leads" ("company", "created_at", "email", "job_title", "last_name", "name", "phone", "updated_at", "website") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @lead = Lead.new(lead_params)

    config_rd_person
    set_lead_rd_person
    @client.create(@people)

    respond_to do |format|
      begin
        #if @client.create(@people)
        if Resque.enqueue(LeadsController)
          if @lead.save

SELECT  "leads".* FROM "leads"  WHERE "leads"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_lead
      @lead = Lead.find(params[:id])